; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v2 - type_2 ?v7 - type_1)
 	      (pred_2 ?v1 - object ?v7 - type_1)
	      (pred_3 ?v2 - type_2 ?v5 - type_3)
	      (pred_1 ?v2 - type_2 ?v1 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v2 - type_2 ?v8 ?v4 - type_1)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v4)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_2 ?v3 - object ?v6 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v6) (pred_4 ?v2 ?v6) (pred_3 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v3 ?v5)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_3 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v3 - object ?v6 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v3 ?v5) (pred_4 ?v2 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_3 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v3 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_03 - type_2
obj_01 obj_13 obj_04 obj_09 - type_3
obj_06 obj_05 obj_07 obj_10 - type_1
obj_08 obj_14 obj_12 obj_11 - object)
(:init
(pred_4 obj_02 obj_07)
(pred_3 obj_02 obj_01)
(pred_3 obj_02 obj_13)
(pred_4 obj_03 obj_10)
(pred_3 obj_03 obj_04)
(pred_3 obj_03 obj_09)
(pred_2 obj_08 obj_06)
(pred_2 obj_14 obj_05)
(pred_2 obj_12 obj_07)
(pred_2 obj_11 obj_10)
)
(:goal
(and
(pred_2 obj_08 obj_06)
(pred_2 obj_14 obj_10)
(pred_2 obj_12 obj_06)
(pred_2 obj_11 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_10)))
)
)

; plan
1. (op_2 obj_02 obj_07 obj_06)
   deleted: (pred_4 obj_02 obj_07)
   added: (pred_4 obj_02 obj_06)
   goals met: 1 of 4
2. (op_3 obj_03 obj_11 obj_10 obj_09)
   deleted: (pred_2 obj_11 obj_10) (pred_3 obj_03 obj_09)
   added: (pred_1 obj_03 obj_11 obj_09)
   goals met: 1 of 4
3. (op_2 obj_03 obj_10 obj_07)
   deleted: (pred_4 obj_03 obj_10)
   added: (pred_4 obj_03 obj_07)
   goals met: 1 of 4
4. (op_2 obj_02 obj_06 obj_05)
   deleted: (pred_4 obj_02 obj_06)
   added: (pred_4 obj_02 obj_05)
   goals met: 1 of 4
5. (op_1 obj_03 obj_11 obj_07 obj_09)
   deleted: (pred_1 obj_03 obj_11 obj_09)
   added: (pred_2 obj_11 obj_07) (pred_3 obj_03 obj_09)
   goals met: 2 of 4
6. (op_3 obj_03 obj_12 obj_07 obj_04)
   deleted: (pred_2 obj_12 obj_07) (pred_3 obj_03 obj_04)
   added: (pred_1 obj_03 obj_12 obj_04)
   goals met: 2 of 4
7. (op_3 obj_02 obj_14 obj_05 obj_13)
   deleted: (pred_2 obj_14 obj_05) (pred_3 obj_02 obj_13)
   added: (pred_1 obj_02 obj_14 obj_13)
   goals met: 2 of 4
8. (op_2 obj_03 obj_07 obj_06)
   deleted: (pred_4 obj_03 obj_07)
   added: (pred_4 obj_03 obj_06)
   goals met: 2 of 4
9. (op_1 obj_02 obj_14 obj_05 obj_13)
   deleted: (pred_1 obj_02 obj_14 obj_13)
   added: (pred_2 obj_14 obj_05) (pred_3 obj_02 obj_13)
   goals met: 2 of 4
10. (op_1 obj_03 obj_12 obj_06 obj_04)
   deleted: (pred_1 obj_03 obj_12 obj_04)
   added: (pred_2 obj_12 obj_06) (pred_3 obj_03 obj_04)
   goals met: 3 of 4
11. (op_2 obj_03 obj_06 obj_05)
   deleted: (pred_4 obj_03 obj_06)
   added: (pred_4 obj_03 obj_05)
   goals met: 3 of 4
12. (op_3 obj_03 obj_14 obj_05 obj_09)
   deleted: (pred_2 obj_14 obj_05) (pred_3 obj_03 obj_09)
   added: (pred_1 obj_03 obj_14 obj_09)
   goals met: 3 of 4
13. (op_2 obj_03 obj_05 obj_10)
   deleted: (pred_4 obj_03 obj_05)
   added: (pred_4 obj_03 obj_10)
   goals met: 3 of 4
14. (op_1 obj_03 obj_14 obj_10 obj_09)
   deleted: (pred_1 obj_03 obj_14 obj_09)
   added: (pred_2 obj_14 obj_10) (pred_3 obj_03 obj_09)
   goals met: 4 of 4
